# Rebar Crank Type Utils Set Crank Ratio Method

Source: https://www.revitapidocs.com/2026/cb13641b-0496-3f40-6e20-77cdd72301b2.htm

---

| Rebar Crank Type Utils Set Crank Ratio Method |
| --- |

Sets the crank ratio value.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static void SetCrankRatio(
	Document document,
	ElementId rebarCrankTypeId,
	double crankRatio
)
```

```
Public Shared Sub SetCrankRatio (
	document As Document,
	rebarCrankTypeId As ElementId,
	crankRatio As Double
)
```

```
public:
static void SetCrankRatio(
	Document^ document,
	ElementId^ rebarCrankTypeId,
	double crankRatio
)
```

```
static member SetCrankRatio :
        document : Document *
        rebarCrankTypeId : ElementId *
        crankRatio : float -> unit
```

#### Parameters

document Document
:   The document.

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.

crankRatio Double
:   The crank ratio value.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | The given value for crankRatio must be positive. |

Remarks The crank slope is 1/crankRatio. See Also

#### Reference

RebarCrankTypeUtils Class Autodesk.Revit.DB.Structure Namespace